{
    "HELLO": "Hello. My name is Yang YiFan, you can call me Nap.\nI'm a game designer who is familiar with level design, UX design, server-client design, formula design, data mining and mathematics.\nDo you want know more about me?Say YES PLEASE to continue or say NO THANKS to quit bot.",
    "YES PLEASE": "Let's me introduce myslef with following list.\nPlease say LIST to check it and you can pick any topic that you want to know more.",
    "LIST":"Please tell me what you want to know.\nSummary, Experience, Skills or Education.",
    "SUMMARY":"I grew up in a military family. Because of that, I went to military school after I graduated from elementary school. This is where I learned discipline and obedience.\nI am a game designer who is familiar with level design, UX design, server-client design, formula design, data mining and mathematics.\nI am passionate about designing software which I believe will be able to make a better lifestyle for everyone in the world.\nI always think about how to make things better. I also think about how to bring more fun to the world.\nBesides, I have great VBA skill to develop excel plug-ins to improve work effectively and efficiently.\nAlso, I've developed an excel file which is able to get data from websites automatically and analyze it.\nI also have great interest in VR/AR industry to embrace the newest technology.\nI'm good at analyzing problems, solving problems and I never stop learning. Live and learn is my favorite motto.\nWhat you want to know more about me? Experience, Skills or Education?",
    "EXPERIENCE":"I've been Game Designer about 6 years at Playcoo.\nAfter playcoo, I went to China to be a Product Planning Manager at Megafone.\nAnd then I found the game industry is still my favorite, so I decided to go back to Taiwan and be a senior game designer at IGG.\nIf you want to know more about my job detail in these company, just tell me the company name.\nOr you can keep follow the list to know more about me. Skills, Education.",
    "SKILLS":"In the game design part, I used to do gameplay design, level design, UI, UX, Mechanics system, skills, mobs and data mining.\nIn the software part, I know about MS word, Excel(VBA), PowerPoint, Project, Lua, Python, VB, Mindjet, OmniGraffle, JIRA, Origami, Photoshop, Mockup, and Unity.\nPlease say EDUCATION to know more detail, or say LIST to check the list again.",
    "EDUCATION":"I graduated from National Cheng Kung University with Master Degree. My major is Civil Engineering.\nBecause of I love to play games, so I decided to be a game designer as career.\nThis is all my introduction. Thanks for giving me this opportunity.\nIf you want to know more, please check my LinkedIn profile. %[Check LinkedIn profile.](https://tw.linkedin.com/in/nap-yang-1b201240)",
    "NO THANKS": "That's ok. Thanks for reaching me out.",
    "CONNECT ME": "",
    "DISCONNECT": "Roger that, NapBot is back."
}
