{
    "HELLO": "Nice to meet you. What can I do for you? %[Introduce yourself](postback:) %[Nothing](postback:)",
    "INTRODUCE YOURSELF": "My name is Yang YiFan, you can call me Nap. I am a 6+years experience game designer from Taiwan Taipei.%[Tell me more](postback:) %[Nothing](postback:)",
    "TELL ME MORE":"I grew up in a military family. Because of that, I went to military school after I graduated from elementary school. This is where I learned discipline and obedience. I am a game designer who is familiar with level design, UX design, server-client design, formula design, data mining and mathematics. I am passionate about designing software which I believe will be able to make a better lifestyle for everyone in the world. I always think about how to make things better. I also think about how to bring more fun to the world. Besides, I have great VBA skill to develop excel plug-ins to improve work effectively and efficiently. Also, I've developed an excel file which is able to get data from websites automatically and analyze it. I also have great interest in VR/AR industry to embrace the newest technology. I'm good at analyzing problems, solving problems and I never stop learning. Live and learn is my favorite motto.%[Why did you join game industry](postback:)",
    "WHAT'S YOUR EXPERIENCE":"I've been Game Designer about 6 years at Playcoo. After playcoo, I went to China Shenzhen to be a Product Planning Manager at Megafone. And then I found the game industry is still my favorite, so I decided to go back to Taiwan and be a senior game designer at IGG. %[Tell me about Playcoo](postback:) %[Tell me about Megafone](postback:) %[Tell me about IGG](postback:)",
    "TELL ME ABOUT YOUR SKILLS":"In the game design part, I used to do gameplay design, level design, UI, UX, Mechanics system, skills, mobs and data mining. In the software part, I know about MS word, Excel(VBA), PowerPoint, Project, Lua, Python, VB, Mindjet, OmniGraffle, JIRA, Origami, Photoshop, Mockup, and Unity. %[Where did you graduate](postback:)",
    "WHERE DID YOU GRADUATE":"I have graduated from National Cheng Kung University with Bachelor and Master degree. My major is Civil Engineering. %[May I have your LinkedIn](postback:)",
    "WHY DID YOU JOIN GAME INDUSTRY":"Because I love to play games, so I think why not give myself a chance to try what I'm dreaming about? %[What's your experience](postback:)",
    "WHY YOU LEFT TO BE PRODUCT PLANNING MANAGER":"Because Foxconn want to build a game platform in India, so they need a guy who familar with game industry and data mining to give them some advice. Besides, I would like to work with people who came from different countries. Compete together, and Improve together. %[Why you go back to Taiwan](postback:) %[Tell me about IGG](postback:)",
    "MAY I HAVE YOUR LINKEDIN":"It's my honor, please check my LinkedIn profile via following link. %[Nap's LinkedIn.](http://tw.linkedin.com/in/nap-yang-1b201240) %[I have no more question](postback:)",
    "I HAVE NO MORE QUESTION":"Thanks. That's all my introduction. Let's keep in touch.",
    "TELL ME ABOUT PLAYCOO":"Playcoo is a game developer who is invested by Gamania group. At first, I was team member of online game DREAM DROPS. I was in charge of designing combat gameplay, level curve, skills, mobs. One day, my supervisor told me that my coworker screwed up and he want me to take over his responsibility such as in-game currency, items, itemmall. I took it and try to make things right.\nAfter DREAM DROPS, I wan the team member of mobile game LUCENT HEART. I was in charge of combat gameplay, level curve, skills, mobs. These are exactly the same as what I'm doing in DREAM DROPS. %[I'm interested in Dream Drops](postback:) %[I'm interested in Lucent Heart](postback:) %[Tell me about Megafone](postback:)",
    "I'M INTERESTED IN DREAM DROPS":"Dream Drops is a MMORPG online game based on gamebryo and it was launched in Hong Kong and Japan about 5 years ago. You can check it via following links. %[Website](http://corp.gamania.com/products/dreamdrops/en/world.htm) %[Video](https://www.youtube.com/watch?v=eoQFqTH8q54) %[I'm interested in Lucent Heart](postback:) %[Tell me about Megafone](postback:)",
    "I'M INTERESTED IN LUCENT HEART":"Lucent Heart is a MMORPG online game based on gamebryo and it was launched in Taiwan, Japan and Canada about 8 years ago. My project was developed Lucent Heart mobile. I created a unique combat gameplay called BATTLE WHEEL, and I never seen it in the market yet. You can check the video via following link. %[Video](https://www.youtube.com/watch?v=SvvTnN_lxiA)\nYou can ask me questions to know more about Battle Wheel or Megafone. %[I'm interested in Battle Wheel](postback:) %[Tell me about Megafone](postback:) %[Tell me about IGG](postback:)",
    "I'M INTERESTED IN BATTLE WHEEL":"Battle wheel is using a series card to give your heros command. The cards line up as a belt, each card refer to a hero. You can swipe the belt to choose which hero gets the most valuable command, but you can't change the card sequence. Besides, you need to place your hero to attack the right enemy. Such as a cavalry is more powerful to attack soilder who held a sword and shield. %[Tell me about Megafone](postback:) %[Tell me about IGG](postback:)",
    "TELL ME ABOUT MEGAFONE":"Megafone is a Original Design Manufacturer in China Shenzhen who is invested by Foxconn. Because of Megafone have plans to bring game and software to India and South-East Asia, so they need a guy who familiar with game industry to give them some advice. I was in charge of researching software market and game market in India and South-East Asia. Developed a VBA program to collect data from website and analyze automaticlly, then report it to boss. %[Why you left to be product planning manager](postback:) %[Why you go back to Taiwan](postback:) %[Tell me about IGG](postback:)",
    "WHY YOU GO BACK TO TAIWAN":"Because I decided to get married. So, my family want me to go back and settle down. Besides, I still love to develop games. I'm dreaming about I could be a game producer one day in the future. Make a good game and bring more fun to the world. %[Tell me about IGG](postback:) %[Tell me about your skills](postback:)",
    "TELL ME ABOUT IGG":"IGG is a China game developer and it has an office in Taiwan Taipei. My responsibility is developing in-game currency and doing data mining about Europe and North America game market. %[Tell me about your skills](postback:)",
    "NOTHING": "That's ok. Thanks for reaching me out.",
    "你好":"很高興認識你，請問有什麼事嗎？ %[請問你從事哪方面的工作](postback:) %[沒事](postback:)",
    "請問你從事哪方面的工作":"我叫楊毅凡，我是一個有6年以上開發經驗的遊戲企劃。 %[好的，介紹一下你自己](postback:)",
    "好的，介紹一下你自己":"我出身在軍人的家庭，國小畢業後去就讀中正預校，在這裡我學習到領導統馭與服從。後來我成為遊戲企劃，我主要負責戰鬥系統、經濟系統、成長曲線等數值方面的工作。我熟悉Excel VBA，工作上我會開發許多插件來增進工作效率，像是一鍵翻譯以及自動比對錯誤等功能。我善於分析、解決問題，喜歡嘗試新的事物與新的科技。活到老學到老，是我最喜歡的座右銘。 %[說說你的工作經歷](postback:)",
    "說說你的工作經歷":"我在玩酷科技擔任了6年的遊戲企劃。後來，我去深圳的手機制造商Megafone擔任產品規劃師。接著，我加入了IGG集團擔任資深數值企劃的工作。 %[我想瞭解玩酷科技](postback:) %[我想瞭解Megafone](postback:) %[我想瞭解IGG](postback:)",
    "我想瞭解玩酷科技":"玩酷科技曾是遊戲橘子旗下的子公司，目前已經轉移到樂陞集團底下。一開始，我是線上遊戲快轉童話的團隊成員，我主要負責戰鬥系統、成長曲線、怪物、技能等工作。後來主企劃告知要我接手原本是其他成員負責的經濟系統，是的，他搞砸了。於是我同時負責遊戲戰鬥與經濟兩大系統，雖然工作量增加為兩倍，但能把事情做對與做好才是我的目標。接著，我加入星辰手遊的開發團隊。我主要負責戰鬥系統、成長曲線、怪物與技能。 #[我想瞭解快轉童話](postback:) %[我想瞭解星辰手遊](postback:) %[我想瞭解Megafone](postback:)",
    "我想瞭解快轉童話":"快轉童話是玩酷科技開發的線上MMORPG，約五年前在香港與日本上市。你可以參考官網連結與影片瞭解更多。%[官方網站](http://corp.gamania.com/products/dreamdrops/en/world.htm) %[影片介紹](https://www.youtube.com/watch?v=eoQFqTH8q54) %[我想瞭解星辰手遊](postback:) %[我想瞭解Megafone](postback:)",
    "我想瞭解星辰手遊":"星辰是玩酷科技開發的線上MMORPG，約八年前在台灣、日本、加拿大上市。我的專案是開發星辰手遊版，我創造了一個全新的戰鬥系統叫做輪轉式戰鬥，目前市面上還沒有類似的玩法出現過。 %[我想瞭解輪轉式戰鬥](postback:) %[我想瞭解Megafone](postback:)",
    "我想瞭解輪轉式戰鬥":"輪轉式戰鬥是由一系列的命令組成連續且不可更換次序的卡牌，每張卡牌對應的是一位英雄的命令，玩家必須思考怎樣的命令組合最適合當下的需要。此外，玩家還需要將英雄擺在對的位置，藉由相生相剋達到最大效益。你可以藉由影片連結更加生動的瞭解輪轉式戰鬥。%[影片連結](https://www.youtube.com/watch?v=SvvTnN_lxiA) %[我想瞭解Megafone](postback:) %[我想瞭解IGG](postback:)",
    "我想瞭解MEGAFONE":"Megafone是位於廣東深圳由富士康投資的手機ODM製造商，主要是針對印度、印尼及其他東南亞市場。由於Megafone有興趣將軟體與遊戲藉由軟硬結合帶入東南亞，因此需要對遊戲業深度瞭解的人給予建議。我主要的工作是做資料採礦針對東南亞的軟體與遊戲市場分析，製作報表提供決策分析。 %[為什麼離開遊戲業](postback:) %[為什麼回來台灣](postback:) %[我想瞭解IGG](postback:)",
    "為什麼離開遊戲業":"其實，並沒有真正離開遊戲業。因為富士康希望能軟硬結合，充實軟體與遊戲的內容市場，所以需要熟悉遊戲與軟體的人才協助。此外，我也希望能走出台灣，多多接觸其他國家的朋友，與其一起競爭一起進步。 %[為什麼回來台灣](postback:) %[我想瞭解IGG](postback:)",
    "為什麼回來台灣":"因為決定要步入人生的下一個階段了，結婚。家人希望我回到台灣穩定下來，考慮未來有小孩後的教育與醫療問題，就決定回台灣了。 %[我想瞭解IGG](postback:) %[你會哪些工作技能](postback:)",
    "我想瞭解IGG":"IGG是中國的遊戲開發商，目前在台北有一個子公司叫掌中乾坤。我目前在這裡擔任資深數值企劃，主要負責規劃經濟系統與做資料採礦以及市場分析的工作。 %[你會哪些工作技能](postback:)",
    "你會哪些工作技能":"遊戲方面，我會設計核心玩法、成長曲線、UI、UX、系統規劃、技能、怪物、遊戲幣經濟循環、道具與商城規劃。軟體方面，我會Word、Excel(VBA)、PowerPoint、Project、Lua、Python、VB、Mindject、OmniGraffle、JIRA、Origami、Photoshop、Mockup以及Unity。%[我想瞭解你的學歷](postback:)",
    "我想瞭解你的學歷":"我從國立成功大學土木工程學系以及土木工程研究所畢業，我碩士主修土木工程結構材料。國中與高中都是中正預校，中正預校是培養國軍幹部的軍事院校。 %[可以給我你的LinkedIn嗎](postback:) %[謝謝，沒有問題了](postback:)",
    "可以給我你的LINKEDIN嗎":"這是我的榮幸。%[楊毅凡的LinkedIn.](http://tw.linkedin.com/in/nap-yang-1b201240) %[謝謝，沒有問題了](postback:)",
    "謝謝，沒有問題了":"謝謝你，我們保持聯絡。",
    "沒事":"沒關係，希望能有機會再次聯絡。",
    "/START":"![nap](https://raw.githubusercontent.com/napyang/EstherBot/master/img/Nap.jpg)\nHi, I am Nap's chatting robot. 嗨，我是楊毅凡的聊天機器人。 %[Hello](postback:) %[你好](postback:)",
    "CONNECT ME": "",
    "DISCONNECT": "Roger that, NapBot is back."
}
