{
    "HELLO": "Hello. I am Nap's robot. You can ask me questions to know more about Nap.\n(Introduce yourself/No thanks)",
    "INTRODUCE YOURSELF": "My name is Yang YiFan, you can call me Nap.\nI am a 6+years experience game designer from Taiwan Taipei.\nYou can ask me questions to know more about Nap.(Tell me more/No thanks)",
    "TELL ME MORE":"I grew up in a military family. Because of that, I went to military school after I graduated from elementary school. This is where I learned discipline and obedience. I am a game designer who is familiar with level design, UX design, server-client design, formula design, data mining and mathematics. I am passionate about designing software which I believe will be able to make a better lifestyle for everyone in the world. I always think about how to make things better. I also think about how to bring more fun to the world. Besides, I have great VBA skill to develop excel plug-ins to improve work effectively and efficiently. Also, I've developed an excel file which is able to get data from websites automatically and analyze it. I also have great interest in VR/AR industry to embrace the newest technology. I'm good at analyzing problems, solving problems and I never stop learning. Live and learn is my favorite motto.\nYou can ask me questions to know more about Nap.(What's your experience/No thanks)",
    "WHAT'S YOUR EXPERIENCE":"I've been Game Designer about 6 years at Playcoo.\nAfter playcoo, I went to China Shenzhen to be a Product Planning Manager at Megafone.\nAnd then I found the game industry is still my favorite, so I decided to go back to Taiwan and be a senior game designer at IGG.\nIf you want to know more about my job detail in these company, just tell me the company name.\nOr You can ask me questions to know more about Nap.(Tell me about your skills/No thanks)",
    "TELL ME ABOUT YOUR SKILLS":"In the game design part, I used to do gameplay design, level design, UI, UX, Mechanics system, skills, mobs and data mining. In the software part, I know about MS word, Excel(VBA), PowerPoint, Project, Lua, Python, VB, Mindjet, OmniGraffle, JIRA, Origami, Photoshop, Mockup, and Unity.\nYou can ask me questions to know more about Nap.(Where did you graduate/No thanks)",
    "WHERE DID YOU GRADUATE":"I have graduated from National Cheng Kung University with Bachelor and Master degree. My major is Civil Engineering.\nYou can ask me questions to know more about Nap.(Why did you join game industry/No thanks)",
    "WHY DID YOU JOIN GAME INDUSTRY":"Because I love to play games, so I think why not give myself a chance to try what I'm dreaming about?\nYou can ask me questions to know more about Nap.(Why you left to be product planning manager/No thanks)",
    "WHY YOU LEFT TO BE PRODUCT PLANNING MANAGER":"Because Foxconn want to build a game platform in India, so they need a guy who familar with game industry and data mining to give them some advice.\nYou can ask me questions to know more about Nap.(May I have your LinkedIn/No thanks)",
    "MAY I HAVE YOUR LINKEDIN":"It's my honor, please check my LinkedIn profile via following link.\nYou can ask me questions to know more about Nap.(I have no more question) %[Nap's LinkedIn.](https://tw.linkedin.com/in/nap-yang-1b201240)",
    "I HAVE NO MORE QUESTION":"Thanks. That's all my introduction. Let's keep in touch.",
    "PLAYCOO":"Playcoo is a game developer who is invested by Gamania group. At first, I was team member of online game DREAM DROPS. I was in charge of designing combat gameplay, level curve, skills, mobs. One day, my supervisor told me that my coworker screwed up and he want me to take over his responsibility such as in-game currency, items, itemmall. I took it and try to make things right.\nAfter DREAM DROPS, I wan the team member of mobile game LUCENT HEART. I was in charge of combat gameplay, level curve, skills, mobs. These are exactly the same as what I'm doing in DREAM DROPS.\nYou can ask me questions to know more about Playcoo or Megafone.(I'm interested in Dream Drops/I'm interested in Lucent Heart/Tell me about Megafone)",
    "I'M INTERESTED IN DREAM DROPS":"Dream Drops is a MMORPG online game based on gamebryo and it was launched in Hong Kong and Japan about 5 years ago. You can check it via following links. %[Website](http://corp.gamania.com/products/dreamdrops/en/world.htm) %[Video](https://www.youtube.com/watch?v=eoQFqTH8q54)\nYou can ask me questions to know more about Playcoo or Megafone.(I'm interested in Lucent Heart/Tell me about Megafone)",
    "I'M INTERESTED IN LUCENT HEART":"Lucent Heart is a MMORPG online game based on gamebryo and it was launched in Taiwan, Japan and Canada about 8 years ago. My project was developed Lucent Heart mobile. I created a unique combat gameplay called BATTLE WHEEL, and I never seen it in the market yet. You can check the video via following link. %[Video](https://www.youtube.com/watch?v=SvvTnN_lxiA)\nYou can ask me questions to know more about Battle Wheel or Megafone.(I'm interested in Battle Wheel/Tell me about Megafone)",
    "I'M INTERESTED IN BATTLE WHEEL":"Battle wheel is using a series card to give your heros command. The cards line up as a belt, each card refer to a hero. You can swipe the belt to choose which hero gets the most valuable command, but you can't change the card sequence. Besides, you need to place your hero to attack the right enemy. Such as a cavalry is more powerful to attack soilder who held a sword and shield.\nYou can ask me questions to know more about Battle Wheel or Megafone.(Tell me about Megafone/Tell me about your skills)",
    "TELL ME MORE ABOUT MEGAFONE":"Megafone is a Original Design Manufacturer in China Shenzhen who is invested by foxconn. My responsibility was researched software market(including game market) in India and make some advice.\nYou can ask me questions to know more about Nap.(Why you go back to Taiwan/Tell me about your skills)",
    "WHY YOU GO BACK TO TAIWAN":"Because I decided to get married. So, my family want me to go back and settle down. Besides, I still love to develop games. I'm dreaming about I could be a game producer one day in the future. Make a good game and bring more fun to the world.\nYou can ask me questions to know more about Nap.(Tell me about your skills/No thanks)",
    "NO THANKS": "That's ok. Thanks for reaching me out.",
    "你好":"你好，我是楊毅凡的聊天機器人，你可以問我問題來深入瞭解楊毅凡。\n(介紹一下你自己/不了 我只是路過)",
    "CONNECT ME": "",
    "DISCONNECT": "Roger that, NapBot is back."
}
